[
	{
		"speaker": "",
		"line": "The slightly-open door is letting a beam of light out of the shed."
	},
	{
		"speaker": "",
		"line": "I open it, and see a decently-decorated interior. Almost like someone lives here."
	},
	{
		"speaker": "",
		"line": "As I step in, I hear a loud metallic bang and feel a sharp pain in the back of my head."
	},
	{
		"speaker": "",
		"line": "I fall to the floor."
	},
	{
		"speaker": "",
		"line": "..."
	},
	{
		"speaker": "",
		"line": "... ..."
	},
	{
		"speaker": "",
		"line": "... ... ..."
	},
	{
		"speaker": "I",
		"line": "\"Ouch...\""
	},
	{
		"speaker": "",
		"line": "I wake up with my limbs bound and my head in pain."
	},
	{
		"speaker": "",
		"line": "The maid that I've seen in the courtyard now stands before me, with a large frying pan in her hands."
	},
	{
		"speaker": "",
		"line": "Now that I look at her she... he? they? does not look... normal. It's like her shape is distorting constantly, always maintaining an identity of a maid but just barely."
	},
	{
		"speaker": "Maid",
		"line": "\"Woke up? Sorry for the inhospitality, I tried to not bang you too hard.\""
	},
	{
		"speaker": "I",
		"line": "\"Um, yeah, I have a couple of questions...\""
	},
	{
		"speaker": "Maid",
		"line": "\"Well you barged into my shed, so I'll ask mine first.\""
	},
	{
		"speaker": "I",
		"line": "\"Uh-huh\""
	},
	{
		"speaker": "Maid",
		"line": "\"So, who are you and where from did you come?\""
	},
	{
		"speaker": "I",
		"line": "\"I woke up in a cave with no memory like 15 minutes ago. Jumped into a hole there and turns out it led here.\""
	},
	{
		"speaker": "Maid",
		"line": "\"A hole? So you're telling me there is a cave above us?\""
	},
	{
		"speaker": "I",
		"line": "\"Yeah? Also a massive shining gate.\""
	},
	{
		"speaker": "",
		"line": "The maid looks at me with a puzzled expression."
	},
	{
		"speaker": "Maid",
		"line": "\"I'll be honest, that is hard to believe, but at this point I don't really care.\""
	},
	{
		"speaker": "Maid",
		"line": "\"Look, I think you already noticed but this place is just... wrong. I've spent my whole life here, and I don't even know how long that is.\""
	},
	{
		"speaker": "Maid",
		"line": "\"Whenever I try to remember something that happened in the past my memory just blanks out.\""
	},
	{
		"speaker": "Maid",
		"line": "\"The place itself seems to resist any kind of change. I've tried breaking stuff, setting fires, killing guards even. It all gets restored the moment I look away.\""
	},
	{
		"speaker": "Maid",
		"line": "\"And everyone here somehow seems fine with it! They don't even notice, it's like they are just parts of the world. Not people, but dolls.\""
	},
	{
		"speaker": "Maid",
		"line": "\"There are exceptions though. They're what kept me sane. There is a princess on a second floor of the estate and a thief imprisoned in the dungeon.\""
	},
	{
		"speaker": "Maid",
		"line": "\"They are a bit less aware than me, but they can notice how this place is wrong if you nudge them a bit.\""
	},
	{
		"speaker": "Maid",
		"line": "\"Anyway, I'll get to the point. You're the first thing to actually... happen here in forever. And I need your help.\""
	},
	{
		"speaker": "Maid",
		"line": "\"I'm sick of this place. I want change. And I think that with you as the catalyst, it can actually happen.\""
	},
	{
		"speaker": "Maid",
		"line": "\"And again, sorry for banging you, I really didn't know how to react. I'll unbind you now.\""
	},
	{
		"speaker": "",
		"line": "The maid unbinds me and helps me up."
	},
	{
		"speaker": "Maid",
		"line": "\"So, will you help me?\""
	},
	{
		"speaker": "I",
		"line": "\"Well, I don't really have many options. Don't see a reason not to.\""
	},
	{
		"speaker": "I",
		"line": "\"Although I still have a question. Why do you look like... that?\""
	},
	{
		"speaker": "Maid",
		"line": "\"You're telling me I look like \"a vague idea of a maid\" instead of being a concrete person?\""
	},
	{
		"speaker": "I",
		"line": "\"Yeah.\""
	},
	{
		"speaker": "Maid",
		"line": "\"Heard that. I suppose it's a part of this place's weirdness?\""
	},
	{
		"speaker": "Maid",
		"line": "\"The princess and the thief look like me too. And you do too, actually. Though you aren't giving me even the vague idea of what you're supposed to be.\""
	},
	{
		"speaker": "Maid",
		"line": "\"You'll get used to it.\""
	}
]